[
  {
    "id": 6,
    "title": "Kabaddi Champions League Haryana Launched in Sonipat, Set to Showcase Grassroots Talent on a Professional Stage",
    "image": "Kabaddi-Champions-League-Haryana-Launched-in-Sonipat.webp",
    "date": "18 August 2025",
    "desc": "Sonipat, Haryana | 18th August 2025 – Haryana, the land of kabaddi legends, today witnessed the grand launch of the Kabaddi Champions League Haryana (KCL) in Sonipat. The event was graced by Shri Krishna Lal Panwar, Cabinet Minister of Haryana, along with senior representatives from AKFI, AKAH, HOA, Kuldeep Singh Dalal (Chairman, AKAH), and Shri Shri 1008 Shri Mahant Bhalegiri Maharaj ji, who together marked a new chapter for kabaddi in the state.<br><br>Officially recognized by the Amateur Kabaddi Association of Haryana (AKAH), KCL aims to take kabaddi from “Gaon to Glory”—providing grassroots players with professional exposure while aligning with the state’s Drug-Free Haryana mission. Guided by Dronacharya Awardee Shri Balwan Singh and supported by kabaddi icons Rajesh Narwal and Mohit Chillar as Brand Ambassadors, the league focuses on fairness, transparency, and player development.<br><br>The inaugural edition will be held in December 2025 in Sonipat, featuring 8 teams, 31 matches, and 16 days of electrifying action. The league promises to not only nurture young talent but also showcase Haryana’s kabaddi strength on bigger stages.<br><br>Shri Krishan Lal Panwar hailed the initiative as a milestone for Haryana’s sporting legacy, emphasizing its role in empowering youth and keeping them away from drugs. The organizers echoed this sentiment, stressing that KCL is more than just matches—it is about careers, discipline, and pride.<br><br>Rajesh Narwal said, “This is a huge opportunity for village players to make their families proud.”<br><br>Mohit Chillar added, “KCL will inspire thousands to see kabaddi as a serious career.”<br><br>With its spirit rooted in Haryana’s soil, the Kabaddi Champions League Haryana is set to become not just a tournament, but a movement for the state’s kabaddi dream."
  },
  {
    "id": 8,
    "title": "Sonipat News: कबड्डी चैंपियनशिप लीग की घोषणा, दिसंबर में पहला सीजन",
    "image": "kcl-annouance.webp",
    "date": "18 August 2025",
    "desc": "सोनीपत। कबड्डी की प्रतिभाओं को प्रोफेशनल मंच देने के लिए कबड्डी चैंपियनशिप लीग हरियाणा (केसीएल) की औपचारिक घोषणा की गई है। कबड्डी चैंपियनिशिप लीग हरियाणा का पहला सीजन दिसंबर में सोनीपत से शुरू होगा।<br>इसमें राज्य की आठ टीमें 16 दिन तक 31 मुकाबलों में भिड़ेंगी। हर टीम को सात मैच खेलने का मौका मिलेगा। आयोजन को लेकर खिलाड़ियों और दर्शकों में खासा उत्साह है। आयोजकों ने बताया कि हरियाणा के गांव-गांव में कबड्डी केवल खेल नहीं बल्कि परंपरा है।<br>इसी जज्बे को प्रोफेशनल पहचान देने के लिए कबड्डी चैंपियनशिप लीग हरियाणा की नींव रखी गई है। इसका मुख्य उद्देश्य गांवों से निकलने वाली प्रतिभा को बड़ा मंच प्रदान करना है। इस पहल को द्रोणाचार्य अवॉर्डी बलवान सिंह दिशा देंगे।<br>खिलाड़ियों को प्रेरित करने के लिए कबड्डी स्टार ऑलराउंडर राजेश नरवाल और प्रसिद्ध डिफेंडर मोहित छिल्लर लीग के ब्रांड एंबेसडर बनाए गए हैं। विकास एवं पंचायत मंत्री कृष्णलाल पंवार ने कहा कि कबड्डी हमारे सांस्कृतिक जीवन का हिस्सा है।<br>इस अवसर पर अमच्योयर कबड्डी एसोसिएशन ऑफ हरियाणा के अध्यक्ष कुलदीप सिंह दलाल और श्रीश्री 1008 महंत भलेगिरी महाराज अतिथि के रूप में मौजूद रहे।"
  },
  {
    "id": 7,
    "title": "सोनीपत में हरियाणा कबड्डी चैंपियंस लीग का शुभारंभ, ग्रामीण प्रतिभाओं को पेशेवर मंच पर मिलेगा नया मंच",
    "image": "Kabaddi-Champions-League-Haryana-Launched-in-Sonipat.webp",
    "date": "18 August 2025",
    "desc": "कबड्डी चैम्पियंस लीग हरियाणा (KCL) को ग्रामीण प्रतिभा को बड़े मंच और टीवी स्क्रीन तक पहुंचाने के लिए एक पेशेवर मंच के रूप में शुरू किया गया है। हरियाणा की धरती, जो अनेकों कबड्डी दिग्गजों की जन्मस्थली है, आज सोनीपत में इसके औपचारिक उद्घाटन की साक्षी बनी, जहां श्री कृष्ण लाल पंवार (कैबिनेट मंत्री), एमेच्योर कबड्डी फेडरेशन ऑफ इंडिया (AKFI), एमेच्योर कबड्डी एसोसिएशन ऑफ हरियाणा (AKAH), हरियाणा ओलंपिक एसोसिएशन (HOA) और पूजनीय श्री श्री 1008 श्री महंत भलेगिरी महाराज जी समेत कई गणमान्य उपस्थित रहे।<br><br>गांव से गौरव तक-<br><br>हरियाणा में कबड्डी सिर्फ खेल नहीं, बल्कि एक भावना है। इसी जज़्बे को आगे बढ़ाने के लिए KCL को आधिकारिक मान्यता AKAH द्वारा दी गई है। इसका उद्देश्य खिलाड़ियों को पेशेवर मंच देकर ग्रामीण स्तर की प्रतिभा को प्रतिस्पर्धी चैंपियन बनाना है। यह लीग \"ड्रग-फ्री हरियाणा\" अभियान से भी जुड़ी है, युवाओं में फिटनेस, अनुशासन और गर्व को बढ़ावा देती है।<br><br>दिशा और प्रेरणा-<br><br>लीग को द्रोणाचार्य अवार्डी श्री बलवान सिंह का मार्गदर्शन प्राप्त है, जबकि स्टार खिलाड़ियों राजेश नरवाल (ऑलराउंडर) और मोहित चिल्लर (डिफेंडर) को ब्रांड एम्बेसडर बनाया गया है।<br><br>पहला टूर्नामेंट-<br><br>दिसंबर 2025 में सोनीपत में पहला संस्करण आयोजित होगा, जिसमें 8 टीमें 16 दिनों में 31 मैच खेलेंगी। यह राज्य के खेल कैलेंडर का बहुप्रतीक्षित आयोजन होगा।<br><br>गौरव का मंच-<br><br>गणमान्यों और ब्रांड एम्बेसडर्स ने इसे खिलाड़ियों को करियर, अनुशासन और राष्ट्रीय स्तर तक पहुंचाने वाला सुनहरा अवसर बताया। यह केवल टूर्नामेंट नहीं, बल्कि हरियाणा की मिट्टी की अदम्य भावना का उत्सव है।"


  },
  {
    "id": 9,
    "title": "कबड्डी चैंपियंस लीग की शुरुआत, ग्रामीण प्रतिभाओं को मिलेगा प्रोफेशनल मंच",
    "image": "Kabaddi-Champions-League-Haryana-Launched-in-Sonipat.webp",
    "date": "18 August 2025",
    "desc": "कैबिनेट मंत्री कृष्ण लाल पंवार व कई दिग्गज खिलाड़ियों की मौजूदगी में औपचारिक घोषणा<br><br>कबड्डी की प्रतिभाओं को प्रोफेशनल मंच देने के लिए कबड्डी चैंपियंस लीग हरियाणा (केसीएल) की औपचारिक घोषणा की गई है। इस अवसर पर अमेच्योर कबड्डी फेडरेशन ऑफ इंडिया के उपाध्यक्ष कैबिनेट मंत्री कृष्ण लाल पंवार, अमेच्योर कबड्डी एसोसिएशन ऑफ हरियाणा के अध्यक्ष कुलदीप सिंह दलाल, हरियाणा ओलंपिक एसोसिएशन के महासचिव महंत भलेगिरी महाराज आदि भी मौजूद रहे।<br><br>आयोजकों ने बताया कि हरियाणा के गांव-गांव में कबड्डी केवल खेल नहीं, बल्कि परंपरा और भावना है। इसी जज़्बे को प्रोफेशनल पहचान देने के लिए कबड्डी चैंपियंस लीग हरियाणा की नींव रखी गई है। यह लीग एकेएएच से मान्यता प्राप्त है। प्रतियोगिता का मुख्य उद्देश्य गांवों से निकलने वाली प्रतिभा को बड़े मंच तक पहुंचाना, खिलाड़ियों को करियर, कल्याण के अवसर देना और उन्हें नशे जैसी बुराइयों से दूर रखते हुए अनुशासन व फिटनेस की ओर प्रेरित करना है।<br><br>इस पहल को द्रोणाचार्य अवाॅर्डी बलवान सिंह दिशा देंगे जबकि खिलाडिय़ों को प्रेरित करने के लिए कबड्डी स्टार ऑलराउंडर राजेश नरवाल और नामी डिफेंडर मोहित छिल्लर लीग के ब्रांड एंबेसडर बनाए गए हैं। कैबिनेट मंत्री कृष्ण लाल पंवार ने कहा कि कबड्डी हमारे सांस्कृतिक जीवन का हिस्सा है। यह लीग युवा खिलाडिय़ों को अपनी क्षमता निखारने का अवसर देगी और नशे जैसी बुराइयों से दूर रखेगी। इस प्रयास से हरियाणा की खेल विरासत और भी मजबूत होगी।<br><br>दिसंबर में होगा पहला सीजन<br><br>कबड्डी चैम्पियंस लीग हरियाणा का पहला सीजन दिसंबर 2025 में सोनीपत से शुरू होगा। इसमें राज्यभर की 8 टीमें 16 दिन तक 31 मुकाबलों में भिड़ेंगी। हर टीम को 7 मैच खेलने का मौका मिलेगा।"
  },
  {
    "id": 1,
    "title": "KCL Haryana kicks off grand trials across the state, thousands of young kabaddi players showcase their talent.",
    "image": "Main.jpeg",
    "date": "24th July",
    "desc": "The Kabaddi Champions League (KCL) Haryana trials have begun with a massive response. Young kabaddi enthusiasts from across the state are showcasing their strength and determination for a chance to compete in the league."
  },
  {
    "id": 2,
    "title": "From Sonipat to Hisar, Panipat to Gurugram – KCL trials witness record participation, building excitement ahead of league.",
    "image": "1.jpeg",
    "date": "24th July",
    "desc": "The trials are witnessing unprecedented participation across Haryana, raising excitement and anticipation for the upcoming KCL season."
  },
  {
    "id": 3,
    "title": "Kabaddi Champions League Haryana 2025 to feature star-studded celebrity events blending sport and entertainment.",
    "image": "2.jpeg",
    "date": "24th July",
    "desc": "This season, the Kabaddi Champions League will not only highlight kabaddi action but also bring entertainment with celebrities joining the events."
  },
  {
    "id": 4,
    "title": "India’s finest kabaddi champions to battle it out on the KCL Haryana mat this season.",
    "image": "3.jpeg",
    "date": "24th July",
    "desc": "Some of India’s top kabaddi players will be part of the league, ensuring thrilling action for fans."
  },
  {
    "id": 5,
    "title": "KCL Haryana 2025 promises to bring grassroots heroes and international kabaddi icons together on one stage.",
    "image": "4.jpg",
    "date": "24th July",
    "desc": "The league aims to unite local kabaddi stars with international players, giving fans the ultimate kabaddi experience."
  }
]
